In [1]:
import numpy as np
import pandas as pd
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

In [2]:
print(s)

a   -0.324964
b    0.620922
c    0.367756
d    0.909816
e    1.763867
dtype: float64

In [3]:
print(s[1:]-s[0])

b    0.945886
c    0.692720
d    1.234780
e    2.088831
dtype: float64

In [5]:
s1 = pd.Series(range(1,6), index=["a", "b", "c", "d", "e"])
print(s1)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [19]:
print(s1[0:]+s1[:-1])

a    2.0
b    4.0
c    6.0
d    8.0
e    NaN
dtype: float64

In [23]:
df = pd.DataFrame(s1)
df.info

<bound method DataFrame.info of    0
a  1
b  2
c  3
d  4
e  5>

In [26]:
df.columns =['one']
df.columns

Index(['one'], dtype='object')

In [27]:
df['two']=df['one']*2

In [29]:
df['three']= df.two * 7
df

   one  two  three
a    1    2     14
b    2    4     28
c    3    6     42
d    4    8     56
e    5   10     70

In [32]:
df['four'] = df.three > 50
df.four.sum()

2

In [35]:
four = df.pop('four')
four

a    False
b    False
c    False
d     True
e     True
Name: four, dtype: bool

In [36]:
df

   one  two  three
a    1    2     14
b    2    4     28
c    3    6     42
d    4    8     56
e    5   10     70

In [37]:
df['four'] = df.two[1:]
df

   one  two  three  four
a    1    2     14   NaN
b    2    4     28   4.0
c    3    6     42   6.0
d    4    8     56   8.0
e    5   10     70  10.0